[
    {
        "name": "A Wrinkle In Time",
        "content": "The story begins with a young girl named Meg Murry. An intelligent thirteen-year-old girl facing many difficulties at her school. Her problems at school aren’t the true source of her troubles, however. Meg’s father, a great scientist, has mysteriously vanished for over a year, while he was away on business.\nMeg also has two twin ten-year-old brothers, Dennys and Sandy, who by our standards are regular children. Meg, however, has another sibling, Charles Wallace, the youngest member of the Murry family. The young five-year-old is by all rights a genius, but also, unfortunately, faces his own difficulties at school.\nOne stormy night, a mysterious and eccentric older woman, by the name of Mrs. Whatsit visits the Murry’s home. During her conversation, she delivers a message to Mrs. Murry that there is such this as the Tesseract. This is a so to speak, a wrinkle in time which can be traveled through. This news startles Mrs. Murry but fills Charles and Meg with great curiosity.\nThe following day, filled with curiosity, Meg and Charles go to visit Mrs. Whatsit home, which happens to be nearby. On their way to the house, they come across Calvin O’Keefe who is a popular boy from Meg’s school. Though skeptical at first, they allow Calvin into Mrs. Whatsit’s dwelling. At the house, the trio learns from Mrs. Whatsit and her friends, Mrs. Who and Mrs. Which, that the universe is in great peril. There’s a powerful entity called The Dark Thing, which has taken the form of a giant cloud. The Dark Thing is currently engulfing all the stars and planets surrounding it. One of these planets includes Camazotz, which is the planet Meg’s father, Mr.Murry is being held, prisoner.\nThe W’s use a tesser, to open a wrinkle in time. This allows them and the children travel into the 5th dimension and arrive at another planet. This planet is Uriel, where the children get a chance to observe the Dark Thing itself. Not only catching a glimpse of the truly massive size of the dark entity but also its destructive power. Also while on Uriel, the group encounters an oracle, which informs them of the path they should take, to reach Camazotz.\nThe group travels to Camazotz, and the three Mrs.W’s instruct the children to stick close together while here. Everything on Camazotz looks almost identical, as the entire planet has been subjected to the power of “IT”. “IT” is a giant disembodied brain, which controls the entire planet from it rhythmic pulses. Charles Wallace goes into combat with IT but unfortunately loses, where he falls under ITs control. Charles is transformed into a robotic creature which speaks using the words IT has infused into him. The mutated Charles leads Meg and Calvin to Mr. Murry’s location, where the new group proceeds to confront IT. IT, unfortunately, proves to be too powerful for them. However, through the quick efforts of Mr. Murry, the group escape to Ixchel by the use of a tesser.\nIxchel is another planet within this dimension, which is inhabited by tall furry beasts, who Mr. Murry and the others find refuge with. Charles Wallace still under ITs control remains, as ITs prisoner on Camazotz. Mrs. Whatsit, Which and Who appear on Ixchel and converse with Meg and the group. Meg realizes that it’s up to him to return to Camazotz and rescue her brother. Mrs. Which informs Meg that she does, in fact, have a weapon she can use against IT. It is the one thing IT does not have, but Meg must figure out what this weapon is, on her own. Filled with the desire to save her brother, Meg returns to Camazotz, for her final confrontation with IT."
    }
]